[
  {
    "id": "book-1764174015087",
    "title": "Supercommunicators",
    "author": "Charles Duhigg",
    "isbn": "9780385697750",
    "coverUrl": "http://books.google.com/books/content?id=oNa_EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "From the Globe and Mail and New York Times bestselling author of The Power of Habit, an investigation of what makes conversations work, and how we can all learn to be supercommunicators at work and in our lives. We all know people who seem capable of connecting with almost anyone. They are the ones we turn to for advice, the ones who ask deep questions but who also seem to hear what we are trying to say. What do they know about conversation that makes them so special? And what can they tell us about how communication really works? Supercommunicators, Charles Duhigg argues, understand—some by intuition, some by hard-won experience—that there is a science to how human beings connect through words. They understand that whenever we speak, we're actually participating in three distinct conversations: What is this really about? How do we feel? And who are we? They know the importance of recognizing—and then matching—each kind of conversation, and how to hear the complex emotions, subtle negotiations and hidden beliefs that color and inform everything we say. Our pasts, our values, our affiliations—our identities—shape every discussion we have, from who will pick up the kids to how we want to be treated at work. With his trademark insight and clarity, Duhigg shows readers how to recognize these three conversations—and teaches us the skills we need to navigate them more successfully. Communication, he argues, is a superpower. By bringing readers into jury deliberations and fraught CIA recruitments, into Netflix's company-wide conversations about equity and the writers' room of The Big Bang Theory, we learn why some people are able to make themselves heard—and to hear others—so clearly. We learn how to recognize and leverage the hidden layers that lurk beneath every conversation. In the end, we learn a simple but powerful lesson: We can connect with anyone, as long as we understand how conversations work.",
    "categories": [
      "Psychology"
    ],
    "progress": 10,
    "status": "reading",
    "dateStarted": "2025-11-25",
    "isCurrent": true
  },
  {
    "id": "book-1763459055473",
    "title": "The Beginning of Infinity",
    "author": "David Deutsch",
    "isbn": "9780141969695",
    "coverUrl": "http://books.google.com/books/content?id=ex5xge75SR4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "'Science has never had an advocate quite like David Deutsch ... A computational physicist on a par with his touchstones Alan Turing and Richard Feynman, and a philosopher in the line of his greatest hero, Karl Popper. His arguments are so clear that to read him is to experience the thrill of the highest level of discourse available on this planet and to understand it' Peter Forbes, Independent In our search for truth, how far have we advanced? This uniquely human quest for good explanations has driven amazing improvements in everything from scientific understanding and technology to politics, moral values and human welfare. But will progress end, either in catastrophe or completion - or will it continue infinitely? In this profound and seminal book, David Deutsch explores the furthest reaches of our current understanding, taking in the Infinity Hotel, supernovae and the nature of optimism, to instill in all of us a wonder at what we have achieved - and the fact that this is only the beginning of humanity's infinite possibility. 'This is Deutsch at his most ambitious, seeking to understand the implications of our scientific explanations of the world ... I enthusiastically recommend this rich, wide-ranging and elegantly written exposition of the unique insights of one of our most original intellectuals' Michael Berry, Times Higher Education Supplement 'Bold ... profound ... provocative and persuasive' Economist 'David Deutsch may well go down in history as one of the great scientists of our age' Scotsman",
    "categories": [
      "Science"
    ],
    "progress": 0,
    "status": "want-to-read",
    "dateStarted": "2025-11-18",
    "isCurrent": false
  },
  {
    "id": "book-1763458537287",
    "title": "Good Things",
    "author": "Samin Nosrat",
    "isbn": "1529106710",
    "coverUrl": "http://books.google.com/books/content?id=57cc0QEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "Once I hand them off to you, these recipes are no longer mine. They're yours, to do with as you please. And maybe, in the act of receiving, a little thread of connection will be woven between me and each of you. How can a recipe express the joy of sharing a meal in person? This is the feeling that Samin Nosrat sets out to capture in Good Things, offering more than 125 recipes for the things she most loves to cook. You'll find go-to recipes for ricotta custard pancakes, chicken braised with apricots and harissa, a crunchy Calabrian chili crisp, super-chewy sky-high focaccia and a decades-in-the-making, childhood-evoking yellow cake. Samin also shares tips and techniques, from how to buy olive oil (check the harvest date) to when to splurge on the best ingredients (salad dressing) to the one acceptable substitute for Parmigiano Reggiano (Grana Padano, if you must). Good Things captures, with Samin's trademark blend of warmth and precision, the essence of what makes cooking such an important source of comfort and delight, and invites you to join her at the table.",
    "categories": [
      "Cooking"
    ],
    "progress": 0,
    "status": "want-to-read",
    "dateStarted": "2025-11-18",
    "isCurrent": false
  },
  {
    "id": "book-1763458421102",
    "title": "The Secret of Secrets",
    "author": "Dan Brown",
    "isbn": "9781473589681",
    "coverUrl": "http://books.google.com/books/content?id=qUQ-EQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Robert Langdon is back in the long-awaited new race-against-time thriller from the global bestselling author of The Da Vinci Code and Angels and Demons. Accompanying celebrated academic, Katherine Solomon, to a lecture she’s been invited to give in Prague, Robert Langdon’s world spirals out of control when she disappears without trace from their hotel room. Far from home and well out of his comfort zone, Langdon must pit his wits against forces unknown to recover the woman he loves. But Prague is an old and dangerous city, steeped in folklore and mystery. For over two thousand years, the tides of history have washed back and forth over it, leaving behind echoes of everything that has gone before. Little can Langdon know that he is being stalked by a spectre from that dark past. He must use all of his arcane knowledge to decipher the world around him before he too is consumed by the rings of treachery and deception that have swallowed Katherine. Against a backdrop of vast castles, towering churches, graveyards buried twelve deep and labyrinthine underground passages, Langdon must navigate a shadow city hiding in plain sight, a city which has successfully kept its secrets for centuries and will not readily deliver them. This is a battlefield unlike any he has previously experienced, one on which he must fight not for his only life, but for the future of humanity itself. The Secret Of Secrets is Dan Brown’s first novel for over eight years and sees the stunning return of Harvard symbologist Robert Langdon, this time pitting his wits against a conspiracy which will test even his considerable brainpower and take him to the edge of losing all that he holds dear... Praise for Dan Brown: ‘Dan Brown is my must-read’ Harlan Coben ‘Exceedingly clever’ The Washington Post ‘A master of smart thrills’ People Magazine ‘Impossible to put down’ The New York Times ‘Dan Brown is the master of the intellectual cliffhanger’ Wall Street Journal ‘For anyone who wants more brain-food than thrillers normally provide’ Sunday Times ‘Dan Brown has to be one of the best, smartest, and most accomplished writers in the country.’ Nelson DeMille",
    "categories": [
      "Fiction"
    ],
    "progress": 0,
    "status": "want-to-read",
    "dateStarted": "2025-11-18",
    "isCurrent": false
  },
  {
    "id": "book-1763458371882",
    "title": "The Gene",
    "author": "Siddhartha Mukherjee",
    "isbn": "9789386057051",
    "coverUrl": "http://books.google.com/books/content?id=A8syDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Spanning the globe and several centuries, The Gene is the story of the quest to decipher the master-code that makes and defines humans, that governs our form and function. The story of the gene begins in an obscure Augustinian abbey in Moravia in 1856, where a monk stumbles on the idea of a ‘unit of heredity’. It intersects with Darwin’s theory of evolution, and collides with the horrors of Nazi eugenics in the 1940s. The gene transforms post-war biology. It reorganizes our understanding of sexuality, temperament, choice and free will. Above all, this is a story driven by human ingenuity and obsessive minds–from Charles Darwin and Gregor Mendel to Francis Crick, James Watson and Rosalind Franklin, and the thousands of scientists still working to understand the code of codes. This is an epic, moving history of a scientific idea being brought to life, by the author of The Emperor of All Maladies. But woven through The Gene, like a red line, is also an intimate history–the story of Mukherjee’s own family and its recurring pattern of mental illness, reminding us that genetics is vitally relevant to everyday lives. These concerns reverberate even more urgently today as we learn to ‘read’ and ‘write’ the human genome–unleashing the potential to change the fates and identities of our children. Majestic in its ambition, and unflinching in its honesty, The Gene gives us a definitive account of the fundamental unit of heredity–and a vision of both humanity’s past and future.",
    "categories": [
      "Science"
    ],
    "progress": 0,
    "status": "want-to-read",
    "dateStarted": "2025-11-18",
    "isCurrent": false
  },
  {
    "id": "book-1763458324844",
    "title": "The Nuclear Age",
    "author": "Serhii Plokhy",
    "isbn": "9781324051183",
    "coverUrl": "http://books.google.com/books/content?id=N5pDEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "A sweeping history of the geopolitics behind the nuclear arms race, from the first atomic bomb to today’s rush to stockpile nuclear weapons. The nuclear age came into existence with the explosion of the first atomic bomb in the New Mexico desert on July 16, 1945. The inauguration of this new era was epitomized by the bomb’s principal creator, J. Robert Oppenheimer, quoting the Bhagavad Gita: “Now I am become death, the destroyer of worlds.” Since then, the era of the atom has become the age of the bomb?or two bombs: atomic and hydrogen. In The Nuclear Age, Serhii Plokhy, one of our preeminent Cold War historians, explores why governments have acquired and stockpiled nuclear weapons and reveals the global failure to reach meaningful nuclear arms treaties. Plokhy shows how, since the Cuban missile crisis of 1962, the risk of nuclear war has never been so high: Russia threatens nuclear aggression in its war on Ukraine; China is constructing hundreds of new missile silos; and India and Pakistan are locked in ongoing nuclear competition. Plokhy also examines how more countries than ever have come within perilous reach of acquiring nuclear arms, while new technologies, such as hypersonic missiles and artificial intelligence, make the nuclear landscape increasingly unpredictable. From Hiroshima, Nagasaki, and the Castle Bravo test of 1954, to the rapidly developing nuclear programs of North Korea and Iran, The Nuclear Age reveals the fear that governs the proliferation of nuclear weapons. Plokhy profiles the global players who have diagnosed, stoked, and influenced this fear, from H. G. Wells to Nikita Khrushchev and Vladimir Putin, and he outlines what we might learn from our past to control today’s arms race. As the danger of nuclear war remains imminent, The Nuclear Age diagnoses our era of rearmament.",
    "categories": [
      "History"
    ],
    "progress": 0,
    "status": "want-to-read",
    "dateStarted": "2025-11-18",
    "isCurrent": false
  },
  {
    "id": "book-1763457575300",
    "title": "Brain",
    "author": "Elizabeth R. Ricker",
    "isbn": "9780241742143",
    "coverUrl": "http://books.google.com/books/content?id=YekTEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Become body literate with Brain: An Owner's Guide, the next book in The Body Literacy Library, an enlightening series that will democratise health for a new generation of readers. Brain: An Owner's Guide is an informative and practical guide to all aspects of brain health, from maximising your mental wellbeing today to protecting your brain against future serious health issues. Leading neuroscientist Eli Ricker explains how the brain works, how you can look after and protect your brain, and explains what you can do to improve your memory and concentration at any age. Ricker also looks at what constitutes mental \"wellbeing\", and the science behind a positive mindset, resilience, concentration and memory, as well as low mood, depression and brain fog. Dementia and other brain disorders are a huge concern for many and Ricker looks at how these occur, the latest medical research, and what you can do to protect your brain for life. From the importance of sleep and stress management to why dementia is a feminist issue, this hard-working book applies science to the everyday, with simple illustrations, checklists, FAQs, and myth busters, all supported by the latest medical research. Brain: An Owner's Guide can help you to better understand your mind and aims to enhance your long-term quality of life.",
    "categories": [
      "Science"
    ],
    "progress": 0,
    "status": "completed",
    "dateStarted": "2025-11-18",
    "dateCompleted": "2025-11-18",
    "notes": "Based on a quick skim while sitting in a cafe, the book explains various ideas related to the human brain, from simple biological explanations to disorders and health conditions",
    "isCurrent": false
  },
  {
    "id": "book-1763457492712",
    "title": "Indians",
    "author": "Namit Arora",
    "isbn": "0670090433",
    "coverUrl": "http://books.google.com/books/content?id=B9MrzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "description": "What do we really know about the Aryan migration theory, and why is that debate so hot? Why did the people of Khajuraho carve erotic scenes on their temple walls? What did the monks at Nalanda eat for dinner? Did our ideals of beauty ever prefer dark skin? Indian civilization has existed for many millennia, but how much do we know about our forebears and their cultural worlds? In this riveting book, Namit Arora takes us on an unforgettable journey through 5000 years of history, reimagining in rich detail the social and cultural moorings of Indians through the ages. Drawing on credible sources, he explores what inspired and shaped them: their political upheavals and rivalries, vocations and trades, and a variety of religious beliefs, festivals, and social set-ups. Arora makes a stop at six iconic places--the Harappan city of Dholavira, the Ikshvaku capital at Nagarjunakonda, the Buddhist centre of learning at Nalanda, enigmatic Khajuraho, Vijayanagar at Hampi, and Varanasi--enlivening the narrative with vivid descriptions, local stories, and evocative photographs. Punctuating this are chronicles of famous travellers who visited India--including Megasthenes, Xuanzang, Alberuni, and Marco Polo--whose dramatic and idiosyncratic tales conceal surprising insights about our land. In lucid and elegant prose, Arora explores the exciting churn of ideas, beliefs, and values that unfolded among our ancestors through the centuries--some continue, for better or worse, to shape modern Indian lives, while others have been lost forever. An original, deeply engaging and extensively researched work, Indians illuminates a range of histories coursing through our veins.",
    "categories": [
      "History"
    ],
    "progress": 0,
    "status": "want-to-read",
    "dateStarted": "2025-11-18",
    "isCurrent": false
  },
  {
    "id": "book-1763394432139",
    "title": "Designing Machine Learning Systems",
    "author": "Chip Huyen",
    "isbn": "9781098107918",
    "coverUrl": "http://books.google.com/books/content?id=EThwEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Machine learning systems are both complex and unique. Complex because they consist of many different components and involve many different stakeholders. Unique because they're data dependent, with data varying wildly from one use case to the next. In this book, you'll learn a holistic approach to designing ML systems that are reliable, scalable, maintainable, and adaptive to changing environments and business requirements. Author Chip Huyen, co-founder of Claypot AI, considers each design decision--such as how to process and create training data, which features to use, how often to retrain models, and what to monitor--in the context of how it can help your system as a whole achieve its objectives. The iterative framework in this book uses actual case studies backed by ample references. This book will help you tackle scenarios such as: Engineering data and choosing the right metrics to solve a business problem Automating the process for continually developing, evaluating, deploying, and updating models Developing a monitoring system to quickly detect and address issues your models might encounter in production Architecting an ML platform that serves across use cases Developing responsible ML systems",
    "categories": [
      "Computers"
    ],
    "progress": 100,
    "status": "completed",
    "dateStarted": "2024-06-10",
    "dateCompleted": "2024-06-13",
    "notes": "Crash course on understanding machine learning in production and the multitude of problems associated with scale",
    "isCurrent": false
  },
  {
    "id": "book-1763392767216",
    "title": "Algorithms to Live By: The Computer Science of Human Decisions",
    "author": "Brian Christian, Griffiths",
    "isbn": "9780007547982",
    "coverUrl": "http://books.google.com/books/content?id=xmeJCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "A fascinating exploration of how computer algorithms can be applied to our everyday lives.",
    "categories": [
      "Computers"
    ],
    "progress": 100,
    "status": "completed",
    "dateStarted": "2023-01-17",
    "dateCompleted": "2024-08-12",
    "notes": "A great read with ideas on caching, explore/exploit, overfitting, and much more. ",
    "isCurrent": false
  },
  {
    "id": "book-1763390182920",
    "title": "The Spinning Magnet",
    "author": "Alanna Mitchell",
    "isbn": "9781786074256",
    "coverUrl": "http://books.google.com/books/content?id=IB-9DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "Many times through deep history Earth’s magnetic poles have switched places, leaving our planet’s protective shield weaker and life vulnerable to devastating solar storms. The last time it happened was 780,000 years ago, long before humans emerged, but it won’t be long until it happens again. And when it does, will it send us back to the Stone Age? The Spinning Magnet is a fascinating insight into what may lie ahead. From the pivotal discoveries of Victorian scientists to the possibility of solar radiation wiping out power grids, and the secrets of electromagnetism, Alanna Mitchell reveals the truth behind one of the most powerful forces in the universe.",
    "categories": [
      "Science"
    ],
    "progress": 55,
    "status": "reading",
    "dateStarted": "2025-09-12",
    "notes": "Learned about the history of magnetism, and how the pursuit of science led humanity to harness it",
    "isCurrent": false
  },
  {
    "id": "book-1762936023895",
    "title": "The Design of Everyday Things",
    "author": "Don Norman",
    "isbn": "9780465072996",
    "coverUrl": "http://books.google.com/books/content?id=I1o4DgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "One of the world's great designers shares his vision of \"the fundamental principles of great and meaningful design\", that's \"even more relevant today than it was when first published\" (Tim Brown, CEO, IDEO). Even the smartest among us can feel inept as we fail to figure out which light switch or oven burner to turn on, or whether to push, pull, or slide a door. The fault, argues this ingenious -- even liberating -- book, lies not in ourselves, but in product design that ignores the needs of users and the principles of cognitive psychology. The problems range from ambiguous and hidden controls to arbitrary relationships between controls and functions, coupled with a lack of feedback or other assistance and unreasonable demands on memorization. The Design of Everyday Things shows that good, usable design is possible. The rules are simple: make things visible, exploit natural relationships that couple function and control, and make intelligent use of constraints. The goal: guide the user effortlessly to the right action on the right control at the right time. The Design of Everyday Things is a powerful primer on how -- and why -- some products satisfy customers while others only frustrate them.",
    "categories": [
      "Design"
    ],
    "progress": 37,
    "status": "reading",
    "dateStarted": "2025-07-01",
    "isCurrent": false
  },
  {
    "id": "book-1762935916414",
    "title": "Tiny Experiments",
    "author": "Anne-Laure Le Cunff",
    "isbn": "9781800819160",
    "coverUrl": "http://books.google.com/books/content?id=2YoKEQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "description": "A transformative guide to rethinking our approach to goals, creativity and life itself from a neuroscientist and entrepreneur 'A compelling new take on a timeless concern' - CAL NEWPORT 'I loved this profound, practical and generous book' - OLIVER BURKEMAN 'Perfect for anyone seeking more freedom in how they design their life' - ALI ABDAAL 'One of the best productivity books that I've read' - RYDER CARROLL 'This book will change the way you design your goals and live your life' - NIR EYAL We're told productivity is all about single-minded focus, hard grind and big goals. Deviating from the linear path means failure. The problem: it's not true. In this transformative book, neuroscientist and entrepreneur Anne-Laure Le Cunff reveals the easier, proven method to achieve our ambitions: an experimental mindset. Ditching out-dated notions of chasing success, she demonstrates the joyful power of 'tiny experiments' in which goals are discovered, pursued and adapted on your own terms. Rooted in science and real-world success stories, Tiny Experiments is packed with tools to help you break free from limiting beliefs, harness the power of imperfection and apply your curiosity - to create a meaningful, productive life in an ever-changing world.",
    "categories": [
      "Business & Economics"
    ],
    "progress": 21,
    "status": "reading",
    "dateStarted": "2025-03-15",
    "isCurrent": false
  }
]